---
kind: property
id: P:Autodesk.Revit.DB.VertexIndexPairArray.Item(System.Int32)
source: html/aaf0977b-ea43-f60e-bc95-750f1eac1dfa.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.Item Property

Gets or sets a VertexIndex pair at a specified index within the array.

## Syntax (C#)
```csharp
public virtual VertexIndexPair this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the VertexIndex pair to be set or retrieved.

## Returns
Returns the VertexIndex pair at the specified index.